#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.4`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].time_rotating.rotating_current: Refreshing state... [id=2025-01-28T16:56:08Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_consumption: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg][0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_engineering: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg][0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app_monitoring: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/actionGroups/mydlz01-dptest-prd-ag001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Read complete after 2s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/locations/northeurope][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Read complete after 2s [id=/servicePrincipals/7f7c7b4a-704d-4531-b73e-45e16b388271][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001][0m
[0m[1mmodule.data_landing_zone.module.platform.azapi_update_resource.virtual_network: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Read complete after 1s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_consumption_budget_subscription.consumption_budget_subscription: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Consumption/budgets/mydlz01-dptest-prd-bdgt][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Read complete after 2s [id=/groups/f3776135-9227-43a1-a4bd-b786a82878fc][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/activityLogAlerts/mydlz01-dptest-prd-alert-servicehealth][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Read complete after 2s [id=/groups/fd3a6a34-8e7c-4315-803a-eedba0cc4b83][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/fafe12e3-0a75-1fb8-874c-7321c9fc00ad][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Read complete after 1s [id=/groups/46a9f467-c63d-4a24-8de9-bb148135bec5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/07c897fe-c555-45e8-0d9a-693753a1770c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/b53ee474-027e-75ab-031e-1bd29c432ad3][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_engineering.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-eng-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/289d4dde-ab16-0076-0d52-723f1da3d5c6][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/7387e2a5-e0cb-1fb1-0552-171c6e31c0f5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/42b6b0bf-6b28-da05-bdff-137011f9ff6c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/4700d76f-a62c-0b65-b713-502abe68b8a0][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/ab454d95-a8f3-e580-9da3-7e1330130597][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/c034e0da-d36b-0d41-3689-d97553048025][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_user_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/6a53fff1-5267-49f8-c6d3-85a8694d0627][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/6cc51790-2012-8a52-b56c-370d31d44f86][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/50f0a8ee-5c44-5bf8-5fdc-be21f0c23e1f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.databricksresourceprovider_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/228c6f79-a278-474c-7f33-1cdfbd6d8dd2][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_consumption.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-cnsmptn-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/983bae5f-adcd-95ef-efb7-9e30a1664f49][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/2249b84c-e43a-3e9a-fcbe-359de7d62f6e][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/6788372c-0df3-5b78-bd0d-5093c9f387b2][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/28b7de41-acd9-0c7a-ba43-6978bc44d0b9][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/e621a3cc-bb27-bf98-3429-18f0b0a2caa3][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/630bb4d1-9b27-0677-a808-7f4aff259154][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/4a77be3d-0e74-96b0-5f2b-222d6aecda11][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/f9906e7a-ce3b-9cda-06c7-994826e496b0][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/4bd22165-69d2-7c78-4717-32aa06d18c49][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/ae7de4e0-4cb8-6540-4d7d-3e6ebb0e0583][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/dcac06e1-750f-efe9-886b-ff60a6b51501][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/e50155cd-d781-1b3a-2ff8-f4b6a40c1742][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_account_external_blob_delegator_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/d8061a88-fa99-7dbd-7f72-462dd9b43392][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_account_curated_blob_delegator_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/0606760d-7947-67fc-c183-5edbac6cf343][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_account_raw_blob_delegator_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/ccf262aa-b7ef-d31f-15b6-53726af239ac][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/af7078b5-c678-7602-53e9-064547ad5057][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/64d2ecb0-96ba-f68a-8462-a05bc170a09a][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_account_workspace_blob_delegator_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/c2b80e04-79ca-05f7-ed6f-0656bfbd93c2][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/16e9667c-8885-014a-e270-e6ff28225004][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/07f0ecc8-1dfa-e80d-c42c-5f8807758b10][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_account_enriched_blob_delegator_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/6c27c646-3484-7dd2-1f42-7da3caf52739][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-kv001-vault-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-fore-kv001-account-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T16:59:09Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T17:00:22Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_accessconnector["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/6a905fe2-4c97-c1be-89b2-1bf02ccd19a6][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_developer["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/d577ebfd-7864-612f-1367-740060a90d1f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_admin["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/64a2498b-2125-631d-56ee-63845e0f0d05][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_service_principal["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/52739c0e-2e12-a95f-5efb-aebf6cb0a561][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T17:00:22Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T16:59:13Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T16:59:36Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T16:59:40Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T16:59:16Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_curated: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_external: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_raw: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_enriched: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/6b38b927-fd38-c179-4727-461344cb4da6][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/8fe2f299-3c46-1ae0-0239-592631b26ef7][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_contributor_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/20cfb268-8956-9c3b-3a0a-71b918121d22][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/0caa3e5f-c6e8-4388-8991-1c8c2dc8d7f5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/b8e30a7f-6d17-b9aa-96f0-2c32e00ae78d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/0effa121-39cd-4bff-271d-776c4dba0732][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/27b5ab07-41d3-c64f-5de0-01e7c77e06a4][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_contributor_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/cb015eef-91b2-2793-8f36-74d9eee08970][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/4049694f-4928-dc9a-0633-cc9ad3f79021][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/40d264b5-9d09-cbe3-6853-ca158aa64045][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/2f6dc2e7-6b5b-87e9-2086-0788405c58e9][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/2a561f1a-7921-9eab-a2ff-a1abecac1806][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/95a04e83-a324-c296-1f5f-e8c579977afd][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_contributor_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/4e9d142a-1828-8c46-7d15-de3adc57db46][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/62b11a44-7388-475d-ac32-601fe6f1071f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/7befae60-8f6b-40a3-7189-71617b747e0a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/fc8e8740-0cbf-5096-3dd1-9a1c066e6662][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_contributor_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/9ddc4ba8-ed12-48bb-8352-ca3b450aed65][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/3e6cef17-befc-a081-7ca1-5bb983daef94][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/8ff3d939-a293-650e-a550-00475597af89][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/e5d41c55-f8b1-8214-42b7-907b3b501da3][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/aa1d7105-bfe1-75f6-46bf-8a6e0907e5e3][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_contributor_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/66c273e6-c30b-78e8-991f-7d5e95521ac1][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/f49ca0c5-c18e-0c07-8ebb-510fd3270960][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/25b87107-3bbb-e1aa-2642-7f967c542a5b][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T17:04:12Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-28T17:03:40Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/13156a2b-db17-4acd-a83e-9760443382af][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_workspace_conf.workspace_conf: Refreshing state... [id=_][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/d4f933fe-2eb2-4809-028e-681bdc9cfe42][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/66cf80ca-1139-efa9-b247-6db4453b6f4c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_accessconnector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/0dafa161-6a6b-d8d3-6060-5a53d0f84ef6][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/79635d67-fef3-1930-3c26-4fd0afb8f147][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["serving"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|serving][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["access"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|access][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["billing"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|billing][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["compute"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|compute][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["lakeflow"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|lakeflow][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["query"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|query][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["marketplace"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|marketplace][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["storage"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|storage][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_admin: Refreshing state... [id=408985471222074][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_service_principal.service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_directory.directory: Refreshing state... [id=/mydlz01-dptest-int][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_budget.budget[0]: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5|99374a02-5efb-431b-9721-c8b48833fc72][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_reader[0]: Refreshing state... [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_developer[0]: Refreshing state... [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_network_connectivity_config.network_connectivity_config: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5/870c297b-0822-4879-8784-82476d41271f][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_credential.credential: Refreshing state... [id=mydlz01-dptest-int-cred][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_scope.secret_scope: Refreshing state... [id=mydlz01-dptest-int-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_storage_credential.storage_credential: Refreshing state... [id=mydlz01-dptest-int-stg-cred][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=0009E49E4A277E3B][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=001359F1D23CA265][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=00180CCCC0356CD6][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_developer[0]: Refreshing state... [id=credential/mydlz01-dptest-int-cred/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_reader[0]: Refreshing state... [id=credential/mydlz01-dptest-int-cred/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_admin: Refreshing state... [id=credential/mydlz01-dptest-int-cred/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_admin: Refreshing state... [id=mydlz01-dptest-int-secret-scope|||app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_developer[0]: Refreshing state... [id=mydlz01-dptest-int-secret-scope|||app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_enriched: Refreshing state... [id=mydlz01-dptest-int-enr][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_raw: Refreshing state... [id=mydlz01-dptest-int-raw][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_admin: Refreshing state... [id=storage_credential/mydlz01-dptest-int-stg-cred/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_external: Refreshing state... [id=mydlz01-dptest-int-ext][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_developer[0]: Refreshing state... [id=storage_credential/mydlz01-dptest-int-stg-cred/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_workspace: Refreshing state... [id=mydlz01-dptest-int-wks][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_curated: Refreshing state... [id=mydlz01-dptest-int-cur][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_reader[0]: Refreshing state... [id=storage_credential/mydlz01-dptest-int-stg-cred/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_admin: Refreshing state... [id=external_location/mydlz01-dptest-int-enr/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_developer[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-enr/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_reader[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-enr/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_admin: Refreshing state... [id=external_location/mydlz01-dptest-int-raw/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_reader[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-raw/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_developer[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-raw/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_service_principal: Refreshing state... [id=credential/mydlz01-dptest-int-cred/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_admin: Refreshing state... [id=external_location/mydlz01-dptest-int-ext/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_developer[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-ext/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_reader[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-ext/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_admin: Refreshing state... [id=external_location/mydlz01-dptest-int-wks/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_developer[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-wks/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_reader[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-wks/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_catalog.catalog_external: Refreshing state... [id=mydlz01-dptest-int][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_admin: Refreshing state... [id=external_location/mydlz01-dptest-int-cur/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_catalog.catalog_internal: Refreshing state... [id=mydlz01-dptest-int-int][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_developer[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-cur/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_reader[0]: Refreshing state... [id=external_location/mydlz01-dptest-int-cur/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_service_principal: Refreshing state... [id=external_location/mydlz01-dptest-int-ext/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_service_principal: Refreshing state... [id=storage_credential/mydlz01-dptest-int-stg-cred/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_service_principal: Refreshing state... [id=external_location/mydlz01-dptest-int-cur/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_service_principal: Refreshing state... [id=external_location/mydlz01-dptest-int-raw/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_directory: Refreshing state... [id=/directories/3524497037927417][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_service_principal: Refreshing state... [id=external_location/mydlz01-dptest-int-wks/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_service_principal: Refreshing state... [id=external_location/mydlz01-dptest-int-enr/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_service_principal: Refreshing state... [id=mydlz01-dptest-int-secret-scope|||99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=/cluster-policies/001359F1D23CA265][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=/cluster-policies/00180CCCC0356CD6][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=/cluster-policies/0009E49E4A277E3B][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_binding.ncc_binding["consumption"]: Refreshing state... [id=621652573719392/870c297b-0822-4879-8784-82476d41271f][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_binding.ncc_binding["engineering"]: Refreshing state... [id=4209744564989843/870c297b-0822-4879-8784-82476d41271f][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-dfs"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/89347579-8bd9-4e19-9ba3-f6b9a1d2a8b6][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-dfs"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/db1e58b0-0183-4520-b16c-02033ebd5dd2][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-blob"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/75057a3b-84f8-4ced-bddc-cc0abf33736d][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-dfs"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/0bb86fe4-a1ba-44ad-b2d5-835b07651d17][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-blob"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/cc179773-dea1-492f-a786-55266f0c48df][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-blob"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/b40bcc71-b6eb-4c23-802d-5c76ebc35a35][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-blob"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/7ad8b89e-7d92-4351-8749-80c26bcfc93e][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-blob"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/922abb8d-9fdc-471b-bc74-da472771758f][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-dfs"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/98b33268-c2b0-4b9d-a44b-092ba4c89381][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-dfs"]: Refreshing state... [id=870c297b-0822-4879-8784-82476d41271f/92cc421e-3f95-4cce-bc50-8a87d987e003][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_service_principal: Refreshing state... [id=catalog/mydlz01-dptest-int/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_admin: Refreshing state... [id=catalog/mydlz01-dptest-int/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_developer[0]: Refreshing state... [id=catalog/mydlz01-dptest-int/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_reader[0]: Refreshing state... [id=catalog/mydlz01-dptest-int/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_admin: Refreshing state... [id=catalog/mydlz01-dptest-int-int/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_service_principal: Refreshing state... [id=catalog/mydlz01-dptest-int-int/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_developer[0]: Refreshing state... [id=catalog/mydlz01-dptest-int-int/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_reader[0]: Refreshing state... [id=catalog/mydlz01-dptest-int-int/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-blob"]: Refreshing state... [id=6988073248006346870][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-dfs"]: Refreshing state... [id=1335366882055808535][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-blob"]: Refreshing state... [id=5379359314369853542][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-dfs"]: Refreshing state... [id=1727407464448876437][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-dfs"]: Refreshing state... [id=7349059566703872765][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-blob"]: Refreshing state... [id=8241399351316837169][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-dfs"]: Refreshing state... [id=745757783797050557][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-blob"]: Refreshing state... [id=2421736410750625507][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-blob"]: Refreshing state... [id=2249652146377609522][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-dfs"]: Refreshing state... [id=235289547894729128][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].data.azuread_service_principal.service_principal[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azuread_service_principal" "service_principal" {
      [32m+[0m[0m account_enabled               = (known after apply)
      [32m+[0m[0m alternative_names             = (known after apply)
      [32m+[0m[0m app_role_assignment_required  = (known after apply)
      [32m+[0m[0m app_role_ids                  = (known after apply)
      [32m+[0m[0m app_roles                     = (known after apply)
      [32m+[0m[0m application_tenant_id         = (known after apply)
      [32m+[0m[0m client_id                     = (known after apply)
      [32m+[0m[0m description                   = (known after apply)
      [32m+[0m[0m display_name                  = "app001-sp"
      [32m+[0m[0m feature_tags                  = (known after apply)
      [32m+[0m[0m features                      = (known after apply)
      [32m+[0m[0m homepage_url                  = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m login_url                     = (known after apply)
      [32m+[0m[0m logout_url                    = (known after apply)
      [32m+[0m[0m notes                         = (known after apply)
      [32m+[0m[0m notification_email_addresses  = (known after apply)
      [32m+[0m[0m oauth2_permission_scope_ids   = (known after apply)
      [32m+[0m[0m oauth2_permission_scopes      = (known after apply)
      [32m+[0m[0m object_id                     = (known after apply)
      [32m+[0m[0m preferred_single_sign_on_mode = (known after apply)
      [32m+[0m[0m redirect_uris                 = (known after apply)
      [32m+[0m[0m saml_metadata_url             = (known after apply)
      [32m+[0m[0m saml_single_sign_on           = (known after apply)
      [32m+[0m[0m service_principal_names       = (known after apply)
      [32m+[0m[0m sign_in_audience              = (known after apply)
      [32m+[0m[0m tags                          = (known after apply)
      [32m+[0m[0m type                          = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_admin[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "databricks_group" "group_admin" {
      [32m+[0m[0m acl_principal_id   = (known after apply)
      [32m+[0m[0m child_groups       = (known after apply)
      [32m+[0m[0m display_name       = "app001-admin"
      [32m+[0m[0m external_id        = (known after apply)
      [32m+[0m[0m groups             = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m instance_profiles  = (known after apply)
      [32m+[0m[0m members            = (known after apply)
      [32m+[0m[0m service_principals = (known after apply)
      [32m+[0m[0m users              = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_developer[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "databricks_group" "group_developer" {
      [32m+[0m[0m acl_principal_id   = (known after apply)
      [32m+[0m[0m child_groups       = (known after apply)
      [32m+[0m[0m display_name       = "app001-developer"
      [32m+[0m[0m external_id        = (known after apply)
      [32m+[0m[0m groups             = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m instance_profiles  = (known after apply)
      [32m+[0m[0m members            = (known after apply)
      [32m+[0m[0m service_principals = (known after apply)
      [32m+[0m[0m users              = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_reader[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "databricks_group" "group_reader" {
      [32m+[0m[0m acl_principal_id   = (known after apply)
      [32m+[0m[0m child_groups       = (known after apply)
      [32m+[0m[0m display_name       = "app001-reader"
      [32m+[0m[0m external_id        = (known after apply)
      [32m+[0m[0m groups             = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m instance_profiles  = (known after apply)
      [32m+[0m[0m members            = (known after apply)
      [32m+[0m[0m service_principals = (known after apply)
      [32m+[0m[0m users              = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_catalog_external_service_principal" {
      [33m~[0m[0m id         = "catalog/mydlz01-dptest-int/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_service_principal" {
      [33m~[0m[0m id         = "catalog/mydlz01-dptest-int-int/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_credential_service_principal" {
      [33m~[0m[0m id         = "credential/mydlz01-dptest-int-cred/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_service_principal" {
      [33m~[0m[0m id                = "external_location/mydlz01-dptest-int-cur/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_service_principal" {
      [33m~[0m[0m id                = "external_location/mydlz01-dptest-int-enr/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_external_location_external_service_principal" {
      [33m~[0m[0m id                = "external_location/mydlz01-dptest-int-ext/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_service_principal" {
      [33m~[0m[0m id                = "external_location/mydlz01-dptest-int-raw/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_service_principal" {
      [33m~[0m[0m id                = "external_location/mydlz01-dptest-int-wks/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_grant" "grant_storage_credential_service_principal" {
      [33m~[0m[0m id                 = "storage_credential/mydlz01-dptest-int-stg-cred/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal          = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m privileges         = [
          [31m-[0m[0m "CREATE_EXTERNAL_LOCATION",
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
            [90m# (3 unchanged elements hidden)[0m[0m
        ]
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_admin[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_admin" {
      [33m~[0m[0m id           = "408985471222074" -> (known after apply)
      [33m~[0m[0m principal_id = 408985471222074 -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_developer[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_developer" {
      [33m~[0m[0m id           = "66271379238954" -> (known after apply)
      [33m~[0m[0m principal_id = 66271379238954 -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_reader[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_reader" {
      [33m~[0m[0m id           = "439960392122911" -> (known after apply)
      [33m~[0m[0m principal_id = 439960392122911 -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_service_principal" {
      [33m~[0m[0m id           = "8089508589893950" -> (known after apply)
      [33m~[0m[0m principal_id = 8089508589893950 -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["DltComputePolicyPtt"][0m will be updated in-place
[0m  [33m~[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
        id                = "/cluster-policies/0009E49E4A277E3B"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m access_control {
          [31m-[0m[0m permission_level       = "CAN_USE" [90m-> null[0m[0m
          [31m-[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [31m-[0m[0m access_control {
          [31m-[0m[0m group_name             = "app001-admin" [90m-> null[0m[0m
          [31m-[0m[0m permission_level       = "CAN_USE" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name       = "app001-admin"
          [32m+[0m[0m permission_level = "CAN_USE"
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["JobComputePolicyPtt"][0m will be updated in-place
[0m  [33m~[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
        id                = "/cluster-policies/001359F1D23CA265"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m access_control {
          [31m-[0m[0m permission_level       = "CAN_USE" [90m-> null[0m[0m
          [31m-[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [31m-[0m[0m access_control {
          [31m-[0m[0m group_name             = "app001-admin" [90m-> null[0m[0m
          [31m-[0m[0m permission_level       = "CAN_USE" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name       = "app001-admin"
          [32m+[0m[0m permission_level = "CAN_USE"
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["PersonalComputePolicyPtt"][0m will be updated in-place
[0m  [33m~[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
        id                = "/cluster-policies/00180CCCC0356CD6"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m access_control {
          [31m-[0m[0m permission_level       = "CAN_USE" [90m-> null[0m[0m
          [31m-[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [31m-[0m[0m access_control {
          [31m-[0m[0m group_name             = "app001-admin" [90m-> null[0m[0m
          [31m-[0m[0m permission_level       = "CAN_USE" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name       = "app001-admin"
          [32m+[0m[0m permission_level = "CAN_USE"
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_directory[0m will be updated in-place
[0m  [33m~[0m[0m resource "databricks_permissions" "permissions_directory" {
        id             = "/directories/3524497037927417"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m access_control {
          [31m-[0m[0m permission_level       = "CAN_MANAGE" [90m-> null[0m[0m
          [31m-[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [31m-[0m[0m access_control {
          [31m-[0m[0m group_name             = "app001-admin" [90m-> null[0m[0m
          [31m-[0m[0m permission_level       = "CAN_MANAGE" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [31m-[0m[0m access_control {
          [31m-[0m[0m group_name             = "app001-developer" [90m-> null[0m[0m
          [31m-[0m[0m permission_level       = "CAN_MANAGE" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [31m-[0m[0m access_control {
          [31m-[0m[0m group_name             = "app001-reader" [90m-> null[0m[0m
          [31m-[0m[0m permission_level       = "CAN_READ" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
          [32m+[0m[0m service_principal_name = (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name       = "app001-admin"
          [32m+[0m[0m permission_level = "CAN_MANAGE"
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name       = "app001-developer"
          [32m+[0m[0m permission_level = "CAN_MANAGE"
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name       = "app001-reader"
          [32m+[0m[0m permission_level = "CAN_READ"
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_secret_acl" "secret_acl_service_principal" {
      [33m~[0m[0m id         = "mydlz01-dptest-int-secret-scope|||99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_service_principal.service_principal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_service_principal" "service_principal" {
      [33m~[0m[0m acl_principal_id           = "servicePrincipals/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m application_id             = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m home                       = "/Users/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
      [33m~[0m[0m id                         = "8089508589893950" -> (known after apply)
      [33m~[0m[0m repos                      = "/Repos/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0" -> (known after apply)
        [90m# (10 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.core.module.databricks_workspace_consumption.time_sleep.sleep_connectivity[0m will be updated in-place
[0m  [33m~[0m[0m resource "time_sleep" "sleep_connectivity" {
      [33m~[0m[0m create_duration = "20s" [33m->[0m[0m "50s"
        id              = "2025-01-28T17:03:40Z"
    }

[1m  # module.data_landing_zone.module.core.module.databricks_workspace_engineering.time_sleep.sleep_connectivity[0m will be updated in-place
[0m  [33m~[0m[0m resource "time_sleep" "sleep_connectivity" {
      [33m~[0m[0m create_duration = "20s" [33m->[0m[0m "50s"
        id              = "2025-01-28T17:04:12Z"
    }

[1mPlan:[0m 15 to add, 6 to change, 15 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>